---
kind: property
id: P:Autodesk.Revit.DB.DetailCurveArray.IsEmpty
source: html/5e1b3bfa-32bf-c7b1-a4d2-9f56c4e49a5d.htm
---
# Autodesk.Revit.DB.DetailCurveArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.